Sequential(
  (0): Flatten(start_dim=1, end_dim=-1)
  (1): Linear(in_features=784, out_features=50, bias=True)
  (2): Linear(in_features=50, out_features=50, bias=True)
  (3): Linear(in_features=50, out_features=50, bias=True)
  (4): Linear(in_features=50, out_features=10, bias=True)
)